const scpDatabase = [
    {
      id: "scp-173",
      name: "SCP-173",
      description: "SCP-173 — це аномальна скульптура, яка має здатність переміщатися, коли її не спостерігають. Вона є надзвичайно агресивною, і здатна убивати своїх жертв, якщо вони не спостерігають за нею. Якщо SCP-173 опиняється під спостереженням, вона залишається нерухомою. Потрібно завжди мати двох осіб для спостереження за ним одночасно, щоб уникнути небезпеки. Її точний склад невідомий, але за виглядом вона нагадує бетонну статую, яка має певні тріщини та пошкодження.",
      image: "images/173.jpg"
    },
    {
      id: "scp-049",
      name: "SCP-049",
      description: "SCP-049 — це аномальний лікар, відомий також як 'Чумачний лікар'. Він є гуманоїдною істотою, яка носить старовинний костюм лікаря чумного часу з черепною маскою. SCP-049 вважає, що людство страждає від 'чуми', і для того, щоб вилікувати хворих, він має звичку вбивати їх, після чого намагається провести невідомі медичні операції. Він вважає, що його 'пацієнти' не можуть бути врятовані, і він сприймає свою місію як священний обов'язок.",
      image: "images/049.jpg"
    },
    {
      id: "scp-682",
      name: "SCP-682",
      description: "SCP-682 — це надзвичайно агресивна істота, відома як 'Ненавидна ящірка'. Вона величезна, з тіла, покритого щільною шкірою, і володіє неймовірною силою та витривалістю. SCP-682 виявляє безмежну ненависть до всього живого, включаючи людей, і робить усе можливе, щоб знищити всі організми навколо. Його неймовірна здатність до адаптації робить його важким для знищення, і навіть після численних спроб нейтралізації воно вціліло.",
      image: "images/images.jpg"
    },
    {
      id: "scp-106",
      name: "SCP-106",
      description: "SCP-106, відомий як 'Старий', є аномальною істотою, яка може проходити через тверді поверхні та змінювати свій розмір. Він виглядає як старий чоловік, і має здатність корумпувати навколишні об'єкти та середовище. SCP-106 здатен створювати портали до 'Корупції' — іншого виміру, де часу немає, і навколишній світ виглядає як спотворене місце, де все розпадається. Він може захоплювати людей і приносити їх до цього світу для власних цілей.",
      image: "images/SCP-106.webp"
    },
    {
      id: "scp-035",
      name: "SCP-035",
      description: "SCP-035 є маскою, яка володіє самосвідомістю. Вона може змінювати свій вигляд, приймаючи обличчя людей і навіть істот, і вона має здатність контролювати розуми тих, хто її носить. При носінні маски, особа, що її носить, поступово втрачає свою волю і стає повністю підконтрольною SCP-035. Маска має досить сильний вплив і може маніпулювати об'єктами, змінюючи свою форму та впливаючи на фізичну реальність.",
      image: "images/031.jpg"
    },
    {
      id: "scp-1730",
      name: "SCP-1730",
      description: "SCP-1730 є величезною аномальною спорудою, розташованою під землею. Ця структура, за зовнішнім виглядом, нагадує стару військову базу, але вона містить численні аномальні об'єкти, які можуть викликати смертельні ситуації. Особливістю SCP-1730 є те, що його інтер'єр змінюється з часом, і всі спроби дослідження приводять до численних смертей або зникнень персоналу. Всі спроби проникнення до бази призводять до дуже високих втрат.",
      image: "images/scp1730.png"
    },
    {
      id: "scp-999",
      name: "SCP-999",
      description: "SCP-999 — це надзвичайно миле і доброзичливе істота, відома як 'Сміхотворне чудовисько'. Воно має вигляд маленького жовтого гуманоїдного тіла з величезною усмішкою. SCP-999 відоме своєю здатністю викликати у людей безперервний сміх і відчуття безтурботності. Проте він має також здатність лікувати депресію та інші психічні розлади, знижуючи рівень стресу та тривоги. Вона є одним із найбільш улюблених SCP у співробітників Фонду.",
      image: "images/scp 999.jpg"
    },
    {
      id: "scp-914",
      name: "SCP-914",
      description: "SCP-914 — це механічний пристрій, який нагадує старовинний механічний млин. Він здатний трансформувати будь-які предмети, які потрапляють в його камеру обробки. Існує кілька режимів обробки: 'Тонкий', 'Середній', 'Рудиментарний' та 'Кращий'. Результати обробки предметів можуть бути непередбачуваними: іноді вони зберігають свої властивості, але в іншому вигляді, а іноді ж вони повністю змінюються або навіть викликають непередбачувані аномалії.",
      image: "images/scp 914.png"
    },
    {
      id: "scp-963",
      name: "SCP-963",
      description: "SCP-963 — це древній артефакт, який має вигляд маленької кулі або кулона, що містить свідомість SCP-963. Це унікальний об'єкт, оскільки він дозволяє об'єднати свідомість особи з іншими людьми. Кожен, хто носить SCP-963, може зберігати і впливати на спогади іншої особи, навіть після її смерті. Це дозволяє зберігати особистість особи в іншому тілі.",
      image: "images/scp 963.png"
    },
    {
      id: "scp-6820",
      name: "SCP-6820",
      description: "SCP-6820 є однією з найбільш небезпечних аномалій у Фонді, це невидиме істота, яке може з'являтися в будь-якому місці. Воно не має постійної форми і здатне маніпулювати навколишнім світом, змінюючи його структуру і викликаючи численні природні катастрофи. Спостереження SCP-6820 на сьогодні неможливе, тому що будь-які спроби взаємодії з ним призводять до повної дестабілізації оточення.",
      image: "images/scp1730.png"
    },
    {
      id: "scp-2000",
      name: "SCP-2000",
      description: "SCP-2000 — це аномальне місце, яке дозволяє здійснювати відновлення людства. Після глобальної катастрофи SCP-2000 здатен відтворювати і відновлювати людські цивілізації з генетичного матеріалу. Воно містить в собі неймовірну кількість ресурсів та обладнання для відновлення людської раси після масового знищення.",
      image: "images/scp 2000.jpg"
    },
    {
      id: "scp-2147",
      name: "SCP-2147",
      description: "SCP-2147 є інтерdimensionalним об'єктом, який змінює реальність. Воно складається з кількох частин, що постійно міняють своє місцезнаходження, зникаючи і з'являючись у різних вимірах. Це створює серйозні труднощі для досліджень і взаємодії з об'єктом. Взаємодія з SCP-2147 вимагає спеціальної техніки і протоколів.",
      image: "images/scp1730.png"
    },
    {
      id: "scp-2317",
      name: "SCP-2317",
      description: "SCP-2317 — це вхід до іншого виміру, через який існують нескінченні реальності, але кожен такий прохід призводить до жахливих наслідків. За повідомленнями, це місце є дуже небезпечним для дослідників і навіть для Фонду. Створення протоколів взаємодії з SCP-2317 є найвищим пріоритетом для вчених Фонду.",
      image: "images/scp-2317.webp"
    },
    {
      id: "scp-5000",
      name: "SCP-5000",
      description: "SCP-5000 — це секретна одиниця, створена для захисту Фонду від непередбачених аномалій, які можуть знищити людство. Вона складається з ряду артефактів, що не тільки забезпечують високий рівень захисту, але й допомагають зберігати всі аномалії під контролем.",
      image: "images/scp 5000.jpg"
    }
  ];
  
  
  
  // scripts.js
  window.addEventListener('DOMContentLoaded', () => {
    const input = document.getElementById('searchInput');
    const results = document.getElementById('searchResults');
  
    if (input && results) {
      input.addEventListener('input', () => {
        const query = input.value.toLowerCase();
        const matches = scpDatabase.filter(obj => obj.name.toLowerCase().includes(query));
        results.innerHTML = '';
        if (matches.length > 0) {
          matches.forEach(scp => {
            const div = document.createElement('div');
            div.classList.add('scp-result');
            div.innerHTML = `
              <h3>${scp.name}</h3>
              <img src="${scp.image}" alt="${scp.name}">
              <p>${scp.description}</p>
            `;
            results.appendChild(div);
          });
        } else {
          results.innerHTML = '<p>Нічого не знайдено.</p>';
        }
      });
    }
  });
  